ci4/app/Models/OAuthUserModel.php

SELECT *
FROM `oauth_users`
WHERE `google_id` = '105450807226409324209'
 LIMIT 1
---
    public function findByGoogleId($googleId)
    {
        return $this->where('google_id', $googleId)->first();

SELECT *
FROM `oauth_users`
WHERE `oauth_users`.`id` = '2'
---
    public function createOrUpdateFromGoogle($googleUser)
    {
        $existingUser = $this->findByGoogleId($googleUser['id']);

        $userData = [
            'google_id'      => $googleUser['id'],
            'email'          => $googleUser['email'],
            'name'           => $googleUser['name'],
            'avatar'         => $googleUser['picture'] ?? null,
            'email_verified' => $googleUser['email_verified'] ?? true,
            'last_login'     => date('Y-m-d H:i:s'),
        ];

        // Add role if provided (from GoogleAuth controller)
        if (isset($googleUser['role'])) {
            $userData['role'] = $googleUser['role'];
        }

        if ($existingUser) {
            // Update existing user, but preserve admin role if already set
            if ($existingUser['role'] === 'admin') {
                $userData['role'] = 'admin'; // Keep admin role
            }
            $this->update($existingUser['id'], $userData);
            return $this->find($existingUser['id']);