ci4/app/Controllers/Artikel.php

SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE `artikel`.`status` = 1
ORDER BY `artikel`.`created_at` DESC
SELECT *
FROM `kategori`
---
    public function index()
    {
        $title = 'Daftar Artikel';
        $model = new ArtikelModel();
        $kategoriModel = new KategoriModel();

        // Get search parameters
        $search = $this->request->getGet('search') ?? '';
        $kategori_id = $this->request->getGet('kategori') ?? '';

        // Build query
        $builder = $model->table('artikel')
            ->select('artikel.*, kategori.nama_kategori')
            ->join('kategori', 'kategori.id_kategori = artikel.id_kategori', 'LEFT')
            ->where('artikel.status', 1); // Only published articles

        // Apply search filter
        if (!empty($search)) {
            $builder->groupStart()
                ->like('artikel.judul', $search)
                ->orLike('artikel.isi', $search)
                ->groupEnd();
        }

        // Apply category filter
        if (!empty($kategori_id)) {
            $builder->where('artikel.id_kategori', $kategori_id);
        }

        // Get results
        $artikel = $builder->orderBy('artikel.created_at', 'DESC')->findAll();

        // Get all categories for filter
        $kategori = $kategoriModel->findAll();

SELECT COUNT(*) AS `numrows`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` =

    `artikel`.`id_kategori`
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` =

    `artikel`.`id_kategori`
 LIMIT 10
---
   public function admin_index()
    {
    $title = 'Daftar Artikel (Admin)';
    $model = new ArtikelModel();
    $q = $this->request->getVar('q') ?? '';
    $kategori_id = $this->request->getVar('kategori_id') ?? '';
    $page = $this->request->getVar('page') ?? 1;
    $builder = $model->table('artikel')

    ->select('artikel.*, kategori.nama_kategori')

    ->join('kategori', 'kategori.id_kategori =

    artikel.id_kategori');
    if ($q != '') {
    $builder->like('artikel.judul', $q);
    }
    if ($kategori_id != '') {
    $builder->where('artikel.id_kategori', $kategori_id);
    }

    $artikel = $builder->paginate(10, 'default', $page);

SELECT *
FROM `kategori`
---
    return $this->response->setJSON($data);
    } else {
    $kategoriModel = new KategoriModel();
    $data['kategori'] = $kategoriModel->findAll();