ci4/app/Controllers/Kategori.php

SELECT *
FROM `kategori`
ORDER BY `id_kategori` ASC
---
    public function index()
    {
        $model = new KategoriModel();
        $data = $model->orderBy('id_kategori', 'ASC')->findAll();