ci4/app/Controllers/Post.php

SELECT *
FROM `artikel`
ORDER BY `id` DESC
---
    public function index()
    {
        $model = new ArtikelModel();
        $data = $model->orderBy('id', 'DESC')->findAll();

SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '10'
DELETE FROM `artikel`
WHERE `id` IN ('10')
---
    public function delete($id = null)
    {
        $model = new ArtikelModel();

        $article = $model->find($id);
        if ($article) {
            // Convert to array if it's an object
            $articleData = is_array($article) ? $article : $article->toArray();

            // Delete associated image file if exists
            if (!empty($articleData['gambar']) && file_exists(FCPATH . 'assets/gambar/' . $articleData['gambar'])) {
                unlink(FCPATH . 'assets/gambar/' . $articleData['gambar']);
            }

            $model->delete($id);