ci4/app/Controllers/UserDashboard.php

    public function index()
    {
        // Check if user is logged in
        if (!session()->get('logged_in')) {
            session()->setFlashdata('error', 'Please login to access dashboard.');
            return redirect()->to('/user/login');
        }

        // Check if user has user role (not admin)
        if (session()->get('role') === 'admin') {
            return redirect()->to('/admin/artikel');
        }

        // Get statistics
        $data = [
            'title' => 'User Dashboard',
            'totalArticles' => $this->artikelModel->countAll(),
            'totalCategories' => $this->kategoriModel->countAll(),
            'recentArticles' => $this->artikelModel->where('created_at >=', date('Y-m-d', strtotime('-30 days')))->countAllResults(),
            'latestArticles' => $this->artikelModel
                ->select('artikel.*, kategori.nama_kategori')
                ->join('kategori', 'kategori.id_kategori = artikel.id_kategori', 'left')
                ->orderBy('artikel.created_at', 'DESC')
                ->limit(4)
                ->find()
---
SELECT COUNT(*) AS `numrows` FROM `artikel`
SELECT COUNT(*) AS `numrows` FROM `kategori`
SELECT COUNT(*) AS `numrows`
FROM `artikel`
WHERE `created_at` >= '2025-06-02'
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
ORDER BY `artikel`.`created_at` DESC
 LIMIT 4